app/views/search/by_group_result.html.erb

SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`group_id` = 5
---
<strong>Понедельник:</strong><br>
<% @group.lessons.each do |lesson| %>