app/views/facultys/show.html.erb

SELECT `groups`.* FROM `groups` WHERE `groups`.`faculty_id` = 1
---

<% @faculty.groups.each do |group| %>