app/views/groups/show.html.erb

<strong>Понедельник:</strong><br>
<% @group.lessons.each do |lesson| %>
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`group_id` = 4