app/controllers/facultys_controller.rb

INSERT INTO `faculties` (`created_at`, `name`, `number`, `updated_at`) VALUES ('2014-10-06 19:29:48', 'info', 8, '2014-10-06 19:29:48')
---
    def create
    	@faculty = Faculty.new(faculty_params)

        if @faculty.save

SELECT `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1
---
	def edit
	    @faculty = Faculty.find(params[:id])

SELECT `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1
UPDATE `faculties` SET `name` = 'informatic', `updated_at` = '2014-10-06 19:30:28' WHERE `faculties`.`id` = 1
---
	def update
	    @faculty = Faculty.find(params[:id])

	    if @faculty.update(faculty_params)

SELECT `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1
---
    def show
        @faculty = Faculty.find(params[:id])

SELECT `faculties`.* FROM `faculties`
---
    def index
        @facultys = Faculty.all