app/controllers/lessons_controller.rb

	def new
		@lesson = Lesson.new
		@group = Group.find(params[:group_id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 4 LIMIT 1

    def create
    	@lesson = Lesson.new(lesson_params)

        if @lesson.save
---
INSERT INTO `lessons` (`created_at`, `day`, `end`, `group_id`, `name`, `start`, `teacher`, `updated_at`) VALUES ('2014-10-06 21:10:35', 3, '14:00', 4, 'матан', '12:45', 'трололо', '2014-10-06 21:10:35')

	def edit
	    @lesson = Lesson.find(params[:id])
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1

	def update
	    @lesson = Lesson.find(params[:id])

	    if @lesson.update(lesson_params)
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
UPDATE `lessons` SET `day` = 1, `updated_at` = '2014-10-06 21:29:02' WHERE `lessons`.`id` = 1

    def show
        @lesson = Lesson.find(params[:id])
	  	@group = Group.find(@lesson.group_id)
	  	@faculty = Faculty.find(@group.faculty_id)
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 4 LIMIT 1
SELECT `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1